FONT = ("Helvetica", 12)
LABEL_WIDTH = 10
ENTRY_WIDTH = 15

# マイジャグラーⅤの設定ごとの確率データ

SETTINGS = {
    1: {"big": 1/273.1, "reg": 1/409.6, "total": 1/163.8, "grape": 1/5.90},
    2: {"big": 1/270.8, "reg": 1/385.5, "total": 1/159.1, "grape": 1/5.85},
    3: {"big": 1/266.4, "reg": 1/336.1, "total": 1/148.6, "grape": 1/5.80},
    4: {"big": 1/254.0, "reg": 1/290.0, "total": 1/135.4, "grape": 1/5.78},
    5: {"big": 1/240.1, "reg": 1/268.6, "total": 1/126.8, "grape": 1/5.76},
    6: {"big": 1/229.1, "reg": 1/229.1, "total": 1/114.6, "grape": 1/5.66},
}
